In [39]:
import pandas as pd
import sqlite3
import _sqlite3

In [40]:
friends_df = pd.read_csv("../data/friends_table.csv")
posts_df = pd.read_csv("../data/posts_table.csv")
reactions_df = pd.read_csv("../data/reactions_table.csv")
users_df = pd.read_csv("../data/user_table.csv")

In [41]:
users_df.head()

    Surname      Name  Age  Subscription Date
0     Smith     Sarah   30         1588157373
1    Picard  Francine   32         1588161732
2      Roth      Hans   40         1588157337
3     Pomme       Ali   28         1588165636
4  Di Lillo     Jordi   42         1588156042

In [42]:
users_df.duplicated().sum()
users_df = users_df.drop_duplicates()

In [43]:
num_rows = len(users_df)
num_rows

1000

In [44]:
users_df.shape

(1000, 4)

In [45]:
users_df['user_id'] = users_df.index +1
users_df.head()

    Surname      Name  Age  Subscription Date  user_id
0     Smith     Sarah   30         1588157373        1
1    Picard  Francine   32         1588161732        2
2      Roth      Hans   40         1588157337        3
3     Pomme       Ali   28         1588165636        4
4  Di Lillo     Jordi   42         1588156042        5

In [46]:
print(users_df)

         Surname      Name  Age  Subscription Date  user_id
0          Smith     Sarah   30         1588157373        1
1         Picard  Francine   32         1588161732        2
2           Roth      Hans   40         1588157337        3
3          Pomme       Ali   28         1588165636        4
4       Di Lillo     Jordi   42         1588156042        5
..           ...       ...  ...                ...      ...
995         Kirk       Lee   19         1588160246      996
996        Pomme     Franz   40         1588159625      997
997       Gwahsi    Thomas   40         1588165504      998
998  Beierlorzer  Jean-Luc   32         1588151074      999
999     Thronton     Franz   28         1588171183     1000

[1000 rows x 5 columns]

In [47]:
(reactions_df)

       User Reaction Type  Reaction Date
0      3741       Comment     1588168107
1       711      Emoticon     1588166846
2       701      Emoticon     1588163334
3      4750      Emoticon     1588168182
4       656       Comment     1588162272
...     ...           ...            ...
26360  2930      Emoticon     1588166570
26361  7677          Like     1588165508
26362   712          Like     1588164897
26363   688      Emoticon     1588164062
26364   723       Comment     1588165527

[26365 rows x 3 columns]

In [48]:
reactions_df['reaction_id'] = reactions_df.index +1

In [49]:
reactions_df.head()

   User Reaction Type  Reaction Date  reaction_id
0  3741       Comment     1588168107            1
1   711      Emoticon     1588166846            2
2   701      Emoticon     1588163334            3
3  4750      Emoticon     1588168182            4
4   656       Comment     1588162272            5

In [50]:
reactions_df.rename(columns = {'User':'user_id'})

       user_id Reaction Type  Reaction Date  reaction_id
0         3741       Comment     1588168107            1
1          711      Emoticon     1588166846            2
2          701      Emoticon     1588163334            3
3         4750      Emoticon     1588168182            4
4          656       Comment     1588162272            5
...        ...           ...            ...          ...
26360     2930      Emoticon     1588166570        26361
26361     7677          Like     1588165508        26362
26362      712          Like     1588164897        26363
26363      688      Emoticon     1588164062        26364
26364      723       Comment     1588165527        26365

[26365 rows x 4 columns]

In [53]:
conn = sqlite3.connect("database.db")

In [55]:
users_df.to_sql("users", conn, if_exists="replace", index=False)

1000